---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.DirectContext3DHandleSettings
source: html/b791269d-8066-6a7f-10a6-11ab42e34177.htm
---
# DirectContext3DHandleSettings Members

Constructs an instance of settings with default values.